%   ماتریس ها
%تعریف ماتریس
A = [1 2 3;4 5 6]
A = [1 2 3 4]
A = [1;2;3;4]
%تعریف ماتریس با مقدار دهی عنصر به عنصر
B(1,1)=1;B(1,2) = 2;B(2,1) = 3;B(2,2) = 4;
B
%هرگاه تعدادی از عناصر ماتریس را رها کرده به صورت پیشفرض با 0 پر می شوند
C(1,1) = 2;C(2,1) = 5;C(2,4) = 8;
C
%ماتریس های خاص
%ماتریس 1
ones(3,5)
%ماتریس صفر
zeros(3,5)
%ماتریس تصادفی
rand(2,4)
%ماتریس همانی
eye(3)
%مربع جادویی
magic(3)
%تعریف ماتریس براساس موارد از پیش تعریف شده
a = 1:4;b=[2 5];c = [1 2 a b]
A = [a;a;1 6 8 9]
D = [A A A]
G = [A;A;A]
H = [A A A;A A A]
%چسباندن دو ماتریس به صورت ستونی
cat(1,ones(3,4),zeros(3,4))
%چسباندن دو ماتریس به صورت سطری
cat(2,ones(3,4),zeros(3,4))
%تکرار آرایه به شیوه ی دلخواه
repmat(A,2,3)
%فراخوانی و مقدار دهی ماتریس
B = [1 2 3 4;5 6 7 8;9 10 11 12;13 14 15 16]
B(1,1)
B(3,end)
B(end,end)
B(1:3,end)
B(3,2:4)
B(2,[2 3])
B(2,1:end)
B(2,:)
B(2,4) = 300
B(2,:) = [1000 250 400 500]
B(:,2) = 250
B([1 2],[3 4])
B(:)
B(2)
%تنسور
U = rand(3,4,2)
U(1,1,2)
%و...به همین منوال
%ذخیره ی چند ماتریس در یک تنسور
A = zeros(4,5)
B = ones(4,5)
C = 5 * ones(4,5)
D(:,:,1) = A;
D(:,:,2) = B;
D(:,:,3) = C;
D
D(:,:,1)
